InformationRegisters/ЗаработанныеПраваНаОтпуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗаработанныеПраваНаОтпуска</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейЗаПериод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЕжегодногоОтпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтпусков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗаработанныеПраваНаОтпуска/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Сотрудник",
		"РегламентированныеДанные");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПередЗаписью(Объект) Экспорт
	СохранитьПрежнийНаборЗаписей(Объект);
КонецПроцедуры

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПриЗаписи(Объект) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОстаткиОтпусков.АналитикаДанных") Тогда
		МодульОстаткиОтпусковАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("ОстаткиОтпусковАналитикаДанных");
		МодульОстаткиОтпусковАналитикаДанных.ЗаполнитьТаблицуОбновленияЗаработанныхПравНаОтпуска(Объект);
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьПрежнийНаборЗаписей(Объект) Экспорт
	
	Отбор = Объект.Отбор;
	Если Не Отбор.Сотрудник.Использование Или Не ЗначениеЗаполнено(Отбор.Сотрудник.Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Отбор.Сотрудник.Значение);
	Запрос.УстановитьПараметр("БезОтбораПоВидуОтпуска", Не Отбор.ВидЕжегодногоОтпуска.Использование);
	Запрос.УстановитьПараметр("ВидЕжегодногоОтпуска", Отбор.ВидЕжегодногоОтпуска.Значение);
	Запрос.УстановитьПараметр("БезОтбораПоПериоду", Не Отбор.Период.Использование);
	Запрос.УстановитьПараметр("Период", Отбор.Период.Значение);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеНабора.Период КАК Период,
		|	ДанныеНабора.Сотрудник КАК Сотрудник,
		|	ДанныеНабора.ВидЕжегодногоОтпуска КАК ВидЕжегодногоОтпуска,
		|	ДанныеНабора.КоличествоДней КАК КоличествоДней
		|ИЗ
		|	РегистрСведений.ЗаработанныеПраваНаОтпуска КАК ДанныеНабора
		|ГДЕ
		|	ДанныеНабора.Сотрудник = &Сотрудник
		|	И (&БезОтбораПоВидуОтпуска
		|	ИЛИ ДанныеНабора.ВидЕжегодногоОтпуска = &ВидЕжегодногоОтпуска)
		|	И (&БезОтбораПоПериоду
		|	ИЛИ ДанныеНабора.Период = &Период)";
	
	Объект.ДополнительныеСвойства.Вставить("ПрежнийНабор", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
